Repository: DanielBrito/desenvolvimento-mobile
Catalog: Aula 8 - Widgets e Material Design/AppLayoutFinal/app/src/main/res/layout/LinFreeze-master/*.po
Languages: es

source: $NAMEPROPER $VERSION -- Utility to prevent permanent file changes.
es: $NAMEPROPER $VERSION -- Programa para evitar cambios permanentes en los archivos.

source: WARNING: While in use, this program makes changes to /etc/fstab.
es: WARNING: cuando está en uso, el programa hace cambios en /etc/fstab.

source: Do not edit these files while a system is frozen, only before and after.
es: No edite estos archivos mientras el sistema esté congelado, hágalo antes o después.

source: Usage:
es: Uso:

source: $PROGNAME [option] [directory or user to freeze or unfreeze]
es: $PROGNAME [opción] [directorio o usuario para congelar o descongelar]

source: Options:
es: Opciones:

source: -h Display this help message and exit.
es: -h Mostrar este mensaje de ayuda y salir.

source: -v Display version information and exit.
es: -v Mostrar la información sobre la versión actual y salir.

source: -d Freeze a directory to prevent permanent file changes.
es: -d Congelar un directorio para evitar cambios permanentes en los archivos.

source: -f Freeze a user account to prevent permanent file changes.
es: -f Congelar una cuenta de usuario para evitar cambios permanentes en los archivos.

source: -u Unfreeze all directories and users.
es: -u Descongelar todos los directorios y usuarios.

source: -s Unfreeze a specific user or directory.
es: -s Descongelar un usuario o directorio específico.

source: -c Remove the temporary directories for user accounts and/or directories.
es: -c Eliminar los directorios temporales correspondientes a las cuentas de usuario y/o directorios.

source: -l Lists the frozen users and directories.
es: -l Listar los usuarios y directorios congelados.

source: You must be the 'root' user to use this utility.
es: Es necesario ser usuario 'root' para utilizar este programa.

source: Directory $DIRF does not exist!
es: El directorio $DIRF no existe.

source: Please enter an existing directory or create it with 'mkdir $DIRF'.
es: Ingrese un directorio existente o cree uno con 'mkdir $DIRF'.

source: This directory is already frozen! Unfreeze it with $PROGNAME -u.
es: Este directorio ya está congelado. Para descongelarlo utilice $PROGNAME -u.

source: If $DIRF is not frozen, use $PROGNAME -c to remove the temporary directory.
es: Si el directorio $DIRF no está congelado, utilice $PROGNAME -c para eliminar el directorio temporal.

source: Making dynamic directory at $OPTARG.dynamic for temporary files...
es: Creando directorio dinámico en $OPTARG.dynamic para los archivos temporales...

source: Would you like to create a directory for read-only files to be laid
es: ¿Desea crear un directorio para guardar los archivos de solo lectura en una capa

source: over the original directory at $DIRF.static? [Y/n]:
es: sobre el directorio original en $DIRF.static? [S/n]:

source: Folder $DIRF is now frozen. Reboot your computer to not make any changes.
es: El directorio ahora está congelado. Reinicie la computadora para evitar cambios.

source: If you wish to put temporary files and/or folders in the 'static' directory, please do so now by putting them in $DIRF.static.
es: Si quiere guardar archivos y/o carpetas temporales en el directorio estático, cópielos ahora en $DIRF.static.

source: Folder $DIRF is now frozen. Reboot your computer to not make any permanent changes.
es: El directorio $DIRF ahora está congelado. Reinicie la computadora para evitar cambios permanentes.

source: If you wish to put temporary files and/or folders in the static directory, please do so now by putting them in $DIRF.static.
es: Si quiere guardar archivos y/o carpetas temporales en el directorio estático, cópielos ahora en $DIRF.static.

source: If you would like to 'freeze' other directories or users, you may do so.
es: Si desea congelar otros directorios o usuarios, puede hacerlo.

source: Folder $DIRF is now 'frozen'. Reboot your computer to not make any permanent changes.
es: El directorio $DIRF ahora está congelado. Reinicie la computadora para evitar cambios permanentes.

source: Directory permissions changed successfully.
es: Los permisos de directo se cambiaron correctamente.

source: Use 'chown [user] $DIRF.dynamic' and 'chown [user] $DIRF.static' to set permissions.
es: Utilice 'chown [usuario] $DIRF.dynamic' y 'chown [usuario] $DIRF.static' para cambiar los permisos.

source: Exiting...
es: Saliendo...

source: Would you like to set the ownership of the temporary directories used for 'freezing'?
es: ¿Desea configurar los permisos de propietarios de los directorios temporales utilizados para el 'congelado'?

source: This is necessary if the directory frozen was inside of a home directory. [Y/n]:
es: Esto es necesario si el directorio congelado está dentro del directorio home. [S/n]:

source: Which user would you like to own the temporary directories?
es: ¿Qué usuario desea configurar como propietario de los directorios temporales?

source: User account $OPTARG does not exist! Create it first.
es: La cuenta de usuario $OPTARG no existe. Debe crearla primero.

source: User account $OPTARG is already frozen!
es: La cuenta de usuario $OPTARG ya está congelada.

source: over the original user directory at /home/$OPTARG.static? [Y/n]:
es: sobre el directorio de usuario original en /home/$OPTARG.static? [S/n]:

source: User account $OPTARG is now 'frozen'. Reboot this computer and log in as $OPTARG to not make any permanent changes.
es: La cuenta de usuario $OPTARG ahora está congelada. Reinicie la computadora e inicie sesión como $OPTARG para evitar cambios permanentes.

source: If you wish to put temporary files and/or folders in the static directory, do so now by putting them in /home/$OPTARG.static.
es: Si quiere guardar archivos y/o carpetas temporales en el directorio estático, cópielos ahora en /home/$OPTARG.static.

source: Making dynamic directory at /home/$OPTARG.dynamic for temporary files...
es: Creando directorio dinámico en /home/$OPTARG.dynamic para los archivos temporales...

source: Would you like to create a directory for read-only files
es: ¿Desea crear un directorio para guardar los archivos de solo lectura

source: to be laid over the user directory at /home/$OPTARG.static? [Y/n]:
es: en una capa sobre el directorio de usuario en /home/$OPTARG.static? [S/n]:

source: Static directory already created. Continuing...
es: El directorio estático ya ha sido creado. Continuando...

source: Preparations complete!
es: Se ha completado la preparación.

source: There are users and/or directories waiting to be un-frozen.
es: Hay usuarios y/o directorios esperando ser descongelados.

source: Please reboot this computer and execute $PROGNAME -c
es: Reinicie la computadora y ejecute $PROGNAME -c

source: Would you like to 'unfreeze' all user accounts and directories? [Y/n]:
es: ¿Desea descongelar todas las cuentas de usuario y directorios? [S/n]:

source: There are no 'frozen' users or directories.
es: No hay cuentas de usuario ni directorios congelados.

source: Freeze them with $PROGNAME [-f user] [-d directory].
es: Congelarlos con $PROGNAME [-f usuario] [-d directorio].

source: Leaving system as-is.
es: Dejando el sistema como está.

source: All user accounts and/or directories have been 'unfrozen'.
es: Las cuentas de usuario y/o directorios han sido descongelados.

source: First reboot your computer for the temporary 'dynamic' directories to be safely unmounted.
es: Primero reinicie la computadora para desmontar los directorios dinámicos temporales de manera segura.

source: Then run $PROGNAME -c after rebooting to remove the temporary directories.
es: Luego ejecute $PROGNAME -c después de reiniciar para eliminar los directorios temporales.

source: If you put any files in a 'static' directory, you may wish to move them elsewhere now.
es: Si guardó archivos en un directorio estático, es el momento de moverlos a otra ubicación.

source: To remove the 'static' directories, if any, use $PROGNAME -c [user or directory] after rebooting.
es: Para eliminar los directorios estáticos, si existen, utilice $PROGNAME -c [usuario o directorio] después de reiniciar.

source: There are no users or directories 'frozen'. Exiting...
es: No hay usuarios ni directorios congelados. Saliendo...

source: Would you like to 'unfreeze' $SPEC? [Y/n]:
es: ¿Desea descongelar $SPEC? [S/n]:

source: User $SPEC has been 'unfrozen'.
es: El usuario $SPEC ha sido descongelado.

source: To remove the 'static' directory, use $PROGNAME -c after rebooting.
es: Para eliminar el directorio estático, utilice $PROGNAME -c después de reiniciar.

source: Directory $SPEC has been 'unfrozen'.
es: El directorio $SPEC ha sido descongelado.

source: User or directory $SPEC is not frozen or does not exist. Exiting...
es: El usuario o directorio $SPEC no está congelado o no existe. Saliendo...

source: This system needs to be rebooted before this function can be used.
es: Para poder utilizar esta función primero debe reiniciar el sistema.

source: Remove temporary directories for 'unfrozen' users/directories? [Y/n]:
es: ¿Desea eliminar los directorios estáticos correspondientes a los usuarios/directorios descongelados? [S/n]:

source: Removed $SPECDYNDIR
es: $SPECDYNDIR ha sido eliminado.

source: Remove 'static directories for 'unfrozen' users/directories?
es: ¿Desea eliminar los directorios estáticos correspondientes a los usuarios/directorios descongelados?

source: If you have files in any static directories, move them elsewhere.
es: Si tiene archivos en los directorios estáticos, muévalos a otra ubicación.

source: Removed $SPECSTATDIR
es: $SPECSTATDIR ha sido eliminado.

source: Remove temporary directories for all users and folders? [Y/n]:
es: ¿Desea eliminar los directorios temporales para todos los usuarios/directorios? [S/n]:

source: 'Dynamic' directories for users removed.
es: Los directorios dinámicos de los usuarios han sido eliminados.

source: Removed $FROZDIR
es: $FROZDIR ha sido eliminado.

source: Remove 'static' directories for all users? [Y/n]:
es: ¿Desea eliminar los directorios estáticos de todos los usuarios? [S/n]:

source: 'Static' directories for users removed.
es: Los directorios estáticos de los usuarios han sido eliminados.

source: Remove 'static' directories for all directories? [Y/n]:
es: ¿Desea eliminar los directorios estáticos correspondientes a todos los directorios? [S/n]:

source: Removed $STATDIR.
es: $STATDIR ha sido eliminado.

source: Cleanup complete!
es: Limpieza terminada.

source: The following directories are 'frozen':
es: Los siguientes directorios están congelados:

source: There appear to be no 'frozen' directories or users on this system.
es: No hay directorios ni usuarios congelados en este sistema.

source: $NAMEPROPER version $VERSION
es: $NAMEPROPER versión $VERSION
